nc: 80

depth_multiple: 0.50
width_multiple: 1.00
max_channels: 512

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO-MaxViT v2 — reduced GFLOPs, same accuracy target
# Key changes vs v1:
#   1. MaxViTCNNBlock window [16,16]→[8,8]: quadratic reduction in attention tokens (256→64 per window)
#   2. MaxViTCNNBlock window [8,8]→[4,4]:  reduces 1024ch attention cost significantly
#   3. Neck C3TR at 512ch replaced with C3k2: transformer kept ONLY at deepest 1024ch scale
#      (where global context matters most; 512ch level has small enough receptive field that CNN suffices)

backbone:
  - [-1, 1, Conv,           [64, 3, 2]]          # 0 - stem, 64ch, stride 2   → 320×320
  - [-1, 1, Conv,           [128, 3, 2]]          # 1 - 128ch, stride 2        → 160×160
  - [-1, 2, C2f,            [256, True]]          # 2 - C2f, 256ch             → 160×160
  - [-1, 1, Conv,           [256, 3, 2]]          # 3 - 256ch, stride 2        → 80×80
  - [-1, 2, C2f,            [512, True]]          # 4 - C2f, 512ch  (P3)       → 80×80
  - [-1, 1, Conv,           [512, 3, 2]]          # 5 - 512ch, stride 2        → 40×40
  - [-1, 1, MaxViTCNNBlock, [512, [8, 8]]]        # 6 - MaxViT 512ch, win 8×8  → 40×40  ✅ was [16,16]
  - [-1, 1, Conv,           [1024, 3, 2]]         # 7 - 1024ch, stride 2       → 20×20
  - [-1, 1, MaxViTCNNBlock, [1024, [4, 4]]]       # 8 - MaxViT 1024ch, win 4×4 → 20×20  ✅ was [8,8]
  - [-1, 1, SPPF,           [1024, 5]]            # 9 - SPPF, 1024ch
  - [-1, 2, C2PSA,          [1024]]               # 10 - C2PSA, 1024ch

# Head — transformer only at the largest/deepest scale (1024ch)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 11 - upsample ×2
  - [[-1, 6], 1, Concat, [1]]                     # 12 - concat with backbone layer 6
  - [-1, 2, C3k2, [512, False]]                   # 13 - C3k2 CNN, 512ch       (P4 feature)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 14 - upsample ×2
  - [[-1, 4], 1, Concat, [1]]                     # 15 - concat with backbone layer 4
  - [-1, 2, C3k2, [256, False]]                   # 16 - C3k2 CNN, 256ch       (P3 output) ✅

  - [-1, 1, Conv, [256, 3, 2]]                    # 17 - downsample, 256ch
  - [[-1, 13], 1, Concat, [1]]                    # 18 - concat with head layer 13
  - [-1, 2, C3k2, [512, False]]                   # 19 - C3k2 CNN, 512ch       (P4 output) ✅ was C3TR

  - [-1, 1, Conv, [512, 3, 2]]                    # 20 - downsample, 512ch
  - [[-1, 10], 1, Concat, [1]]                    # 21 - concat with backbone layer 10
  - [-1, 2, C3TR, [1024, True]]                   # 22 - C3TR Transformer, 1024ch (P5 output) ✅ kept

  - [[16, 19, 22], 1, Detect, [nc]]               # 23 - detect head: P3, P4, P5

  # Design rationale:
  # - P3 (small objects, 80×80):  CNN only → fast, fine-grained local features
  # - P4 (medium objects, 40×40): CNN only → good local receptive field, cheaper
  # - P5 (large objects, 20×20):  Transformer → global context where it helps most
  # - MaxViT windows shrunk so fewer tokens per window = less attention compute
